SELECT Назва AS 'Відділення', 
COUNT(лікар.Код_лікаря) AS 'Кількість лікарів'
FROM відділення
INNER JOIN лікар ON лікар.Код_відділення = відділення.Код_відділення
GROUP BY Назва

SELECT YEAR(Дата_запису) AS Рік, MONTH(Дата_запису) AS Місяць, COUNT(Код_пацієнта) AS 'Кількість пацієнтів'
FROM реєстрація
GROUP BY Рік, Місяць WITH ROLLUP

SELECT Стать, FLOOR(AVG(Вік)) AS 'Середній вік пацієнта'
FROM пацієнт
GROUP BY Стать

SELECT пацієнт.Прізвище, Діагноз, 
DATEDIFF(Дата_виписки, Дата_запису) AS 'Кількість днів лікування'
FROM реєстрація
INNER JOIN пацієнт ON реєстрація.Код_пацієнта = пацієнт.Код_пацієнта
WHERE DATEDIFF(Дата_виписки, Дата_запису) = (
		SELECT MAX(DATEDIFF(Дата_виписки, Дата_запису))
		FROM реєстрація)
GROUP BY Діагноз
