START TRANSACTION;
INSERT INTO лікар VALUE (13, 'Левкін', 'Іван', 'Володимирович', 8, 2, 1, 8, 10);
INSERT INTO лікар VALUE (14, 'Любченко', 'Анна', 'Олександрівна', 8, 1, 1, 8, 8);
INSERT INTO лікар VALUE (15, 'Лоневський', 'Любомир', 'Миколайович', 8, 1, 1, 8, 9);
INSERT INTO лікар VALUE (16, 'Магдяк ', 'Андрій', 'Ярославович', 8, 2, 1, 8, 15);
COMMIT;

INSERT INTO спеціалізація VALUE (8, 'Стоматолог');

START TRANSACTION;
INSERT INTO лікар VALUE (13, 'Левкін', 'Іван', 'Володимирович', 8, 2, 1, 8, 10);
INSERT INTO лікар VALUE (14, 'Любченко', 'Анна', 'Олександрівна', 8, 1, 1, 8, 8);
INSERT INTO лікар VALUE (15, 'Лоневський', 'Любомир', 'Миколайович', 8, 1, 1, 8, 9);
INSERT INTO лікар VALUE (16, 'Магдяк ', 'Андрій', 'Ярославович', 8, 2, 1, 8, 15);
COMMIT;
