SELECT Діагноз FROM реєстрація
WHERE Код_пацієнта = 2

SELECT пацієнт.Прізвище, пацієнт.`Ім'я`, пацієнт.`По-батькові`, реєстрація.Дата_запису,
реєстрація.Дата_виписки, реєстрація.Діагноз
FROM пацієнт
LEFT JOIN реєстрація ON реєстрація.Код_пацієнта = пацієнт.Код_пацієнта

SELECT concat(лікар.Прізвище, ' ', лікар.`Ім'я`, ' ', лікар.`По-батькові`) as 'Лікар', 
реєстрація.Код_пацієнта, реєстрація.Діагноз
FROM лікар
INNER JOIN реєстрація ON реєстрація.Код_лікаря = лікар.Код_лікаря
WHERE Діагноз = 'Атеросклероз'

SELECT реєстрація.Код_пацієнта, лікар.Прізвище as 'Лікар', категорія.Назва
FROM лікар INNER JOIN реєстрація INNER JOIN категорія
ON реєстрація.Код_лікаря = лікар.Код_лікаря AND категорія.Код_категорії = лікар.Код_категорії
WHERE категорія.Назва IN ('Вища', 'Перша')

SELECT лікар.Прізвище as 'Лікар', 
(SELECT Прізвище FROM пацієнт WHERE пацієнт.Код_пацієнта = реєстрація.Код_пацієнта) as 'Пацієнт', Діагноз
FROM лікар
INNER JOIN реєстрація ON лікар.Код_лікаря = реєстрація.Код_лікаря
WHERE Код_категорії IN (SELECT Код_категорії FROM категорія WHERE Назва = 'Вища');

SELECT * FROM лікар
WHERE NOT EXISTS
(SELECT * FROM реєстрація 
WHERE реєстрація.Код_лікаря = лікар.Код_лікаря)

SELECT Прізвище, `Ім'я`, Номер_телефона
FROM пацієнт
WHERE CHAR_LENGTH(Номер_телефона)<13 AND Номер_телефона NOT LIKE '^\+?3?8?(0\d{9})$';

