CREATE VIEW пацієнт_в AS SELECT DISTINCT Код_пацієнта, Прізвище, `Ім'я`, `По-батькові`
FROM пацієнт

CREATE VIEW реєстрація_в AS SELECT DISTINCT Код_пацієнта, Дата_запису, Дата_виписки, Діагноз
FROM реєстрація

SELECT * FROM реєстрація_в
WHERE Дата_запису >= '2020-10-01' AND Дата_запису < '2020-11-01'

SELECT пацієнт_в.Прізвище, пацієнт_в.`Ім'я`, пацієнт_в.`По-батькові`, реєстрація_в.Дата_запису, 
реєстрація_в.Дата_виписки, реєстрація_в.Діагноз
FROM пацієнт_в, реєстрація_в
WHERE реєстрація_в.Код_пацієнта = пацієнт_в.Код_пацієнта

SELECT пацієнт_в.Прізвище, пацієнт_в.`Ім'я`, пацієнт_в.`По-батькові`, реєстрація_в.Дата_запису, 
реєстрація_в.Дата_виписки, реєстрація_в.Діагноз
FROM пацієнт_в, реєстрація_в
WHERE реєстрація_в.Код_пацієнта = пацієнт_в.Код_пацієнта AND реєстрація_в.Діагноз = 'Гастрит'
